Revit 2015 API
GeometryCreationUtilities Methods
Methods
Name | Description
CreateBlendGeometry(CurveLoop, CurveLoop, ICollection<VertexPair>)
 Creates a solid by blending two closed curve loops lying in non-coincident planes.
CreateBlendGeometry(CurveLoop, CurveLoop, ICollection<VertexPair>, SolidOptions)
 Creates a solid by blending two closed curve loops lying in non-coincident planes.
CreateExtrusionGeometry(IList<CurveLoop>, XYZ, Double)
 Creates a solid by linearly extruding one or more closed coplanar curve loops.
CreateExtrusionGeometry(IList<CurveLoop>, XYZ, Double, SolidOptions)
 Creates a solid by linearly extruding one or more closed coplanar curve loops.
CreateRevolvedGeometry(Frame, IList<CurveLoop>, Double, Double)
 Creates a solid of revolution by revolving a set of closed curve loops around an axis by a specified angle.
CreateRevolvedGeometry(Frame, IList<CurveLoop>, Double, Double, SolidOptions)
 Creates a solid of revolution by revolving a set of closed curve loops around an axis by a specified angle.
CreateSweptBlendGeometry(Curve, IList<Double>, IList<CurveLoop>, IList<ICollection<VertexPair>>)
 Creates a solid by simultaneously sweeping and blending two or more closed planar curve loops along a single curve.
CreateSweptBlendGeometry(Curve, IList<Double>, IList<CurveLoop>, IList<ICollection<VertexPair>>, SolidOptions)
 Creates a solid by simultaneously sweeping and blending two or more closed planar curve loops along a single curve.
CreateSweptGeometry(CurveLoop, Int32, Double, IList<CurveLoop>)
 Creates a solid by sweeping one or more closed coplanar curve loops along a path.
CreateSweptGeometry(CurveLoop, Int32, Double, IList<CurveLoop>, SolidOptions)
 Creates a solid by sweeping one or more closed coplanar curve loops along a path.
See Also
GeometryCreationUtilities Class
Autodesk.Revit.DB Namespace